//1)შექმენით ობიექტი მანქანა. 
// გაუკეთეთ მახასიათებლები: მარკა, მოდელი, ფერი, გამოშვების წელი, ფასი, ცხენის ძალა. 
// შემდეგ დაბეჭდეთ სტრინგი რომელიც შეიცავს ყველა ზემოთაღნიშნულ ველს პარამეტრად.

// დაბეჭდილი ტექსტი უნდა იყოს შემდეგ ფორმატში:
// “ამ მანქანას აქვს შემდეგი მახასიათებლები:
// მარკა - აუდი,
// ფერი - თეთრი,
// Მოდელი - A4,
// გამოშვების წელი - 2019,
// ცხენის ძალა - 190,
// ფასი - 20 000 $”.

let car = {
	mark: "აუდი",
	color: "თეთრი",
	model: "A4",
	year: "2019",
	power: "190",
	price: "20 000$"
}

console.log(`ამ მანქანას აქვს შემდეგი მახასიათებლები: 
მარკა - ${car.mark}
ფერი - ${car.color}
მოდელი - ${car.model}
გამოსვების წელი - ${car.model}
ცხენის ძალა - ${car.power}
ფასი - ${car.price}`);

// 2)შექმენით ზემოთხსენებული მახასიათებლების მქონე რამდენიმე მანქანის ობიექტი. 
// გააკეთეთ მანქანების მასივი და ციკლის გამოყენებით დაბეჭდეთ ყველა იმ მანქანის მარკა და მოდელი, 
// რომლის ფასიც ნაკლებია 15000. თუ ასეთი არ მოიძებნა დაბეჭდეთ “სამწუხაროდ ამ ფასში მანქანას ვერ შეიძენთ :( ”

let Audi = {
    mark: "აუდი",
	color: "თეთრი",
	model: "A4",
	year: "2019",
	power: "190",
	price: "20000"
};

let BMW = {
    mark: "BMW",
	color: "ლურჯი",
	model: "A3",
	year: "2018",
	power: "190",
	price: "30000"
};

let TOYOTA = {
    mark: "ტოიოტა",
	color: "ვერცხლისფერი",
	model: "A5",
	year: "2018",
	power: "200",
	price: "40000"
};

let HONDA = {
    mark: "ჰონდა",
	color: "ნაცრისფერი",
	model: "A6",
	year: "2018",
	power: "150",
	price: "10000"
};

let cars = [];

cars.push(Audi);
cars.push(BMW);
cars.push(TOYOTA);
cars.push(HONDA);

let CheapCars = [];
for(let i = 0; i < cars.length; i++) {
    if(cars[i].price < 15000) {
        CheapCars.push(cars[i]);
    }
}
if(CheapCars.length > 0) {
    for(let i = 0; i < CheapCars.length; i++) {
    console.log(CheapCars[i].mark, CheapCars[i].model) 
    }
} else {console.log("სამწუხაროდ ამ ფასში მანქანას ვერ შეიძენთ")}

